In [1]:
from utils import *

In [9]:
import pandas as pd

In [4]:
data_dir = '../data/'

# Dubai - 2981155

In [6]:
dubai_sensors_ids = get_sensors_ids(2981155)
dubai_sensors_ids

[10071460, 10071461, 10071465, 10071467, 10071470, 10071471]

In [7]:
dubai_sensors_ids = validate_sensors_ids(dubai_sensors_ids)
dubai_sensors_ids

[10071461]

In [8]:
dubai_df = pd.DataFrame(columns=['value', 'utc', 'local', 'parameter', 'units'])
dubai_df

Empty DataFrame
Columns: [value, utc, local]
Index: []

In [9]:
for year in range(2024, 2025):
    for month in range(1, 13):
        data = get_data(10071461, year, month)
        if isinstance(data, requests.models.Response):
            break
        dubai_df = pd.concat([dubai_df, data])

2024-1 to 2024-2: 0
2024-2 to 2024-3: 0
2024-3 to 2024-4: 0
2024-4 to 2024-5: 0
2024-5 to 2024-6: 0
2024-6 to 2024-7: 0
2024-7 to 2024-8: 148

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/4058671578.py:7: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  dubai_df = pd.concat([dubai_df, data])

2024-8 to 2024-9: 725
2024-9 to 2024-10: 696
2024-10 to 2024-11: 24
2024-11 to 2024-12: 0
2024-12 to 2025-1: 0

In [10]:
dubai_df.head()

   value                   utc                      local parameter  units
0   40.0  2024-07-25T16:00:00Z  2024-07-25T20:00:00+04:00      pm25  µg/m³
1   53.0  2024-07-25T17:00:00Z  2024-07-25T21:00:00+04:00      pm25  µg/m³
2   45.0  2024-07-25T18:00:00Z  2024-07-25T22:00:00+04:00      pm25  µg/m³
3   47.0  2024-07-25T19:00:00Z  2024-07-25T23:00:00+04:00      pm25  µg/m³
4   54.0  2024-07-25T20:00:00Z  2024-07-26T00:00:00+04:00      pm25  µg/m³

In [20]:
dubai_df.shape

(1593, 5)

In [12]:
dubai_df.to_csv(data_dir + 'openaq_dubai_2981155.csv', index=False)

# Doha - 309834

In [4]:
doha_sensors_ids = get_sensors_ids(309834)
doha_sensors_ids

[1757563, 1757564]

In [5]:
doha_sensors_ids = validate_sensors_ids(doha_sensors_ids)
doha_sensors_ids

[1757563]

In [6]:
doha_df = pd.DataFrame(columns=['value', 'utc', 'local', 'parameter', 'units'])
doha_df

Empty DataFrame
Columns: [value, utc, local]
Index: []

In [7]:
for year in range(2022, 2025):
    for month in range(1, 13):
        data = get_data(1757563, year, month)
        if isinstance(data, requests.models.Response):
            break
        doha_df = pd.concat([doha_df, data])

2022-1 to 2022-2: 0
2022-2 to 2022-3: 0
2022-3 to 2022-4: 0
2022-4 to 2022-5: 425

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52765/3071789808.py:7: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  doha_df = pd.concat([doha_df, data])

2022-5 to 2022-6: 289
2022-6 to 2022-7: 643
2022-7 to 2022-8: 563
2022-8 to 2022-9: 447
2022-9 to 2022-10: 27
2022-10 to 2022-11: 714
2022-11 to 2022-12: 695
2022-12 to 2023-1: 630
2023-1 to 2023-2: 572
2023-2 to 2023-3: 76
2023-3 to 2023-4: 224
2023-4 to 2023-5: 531
2023-5 to 2023-6: 506
2023-6 to 2023-7: 473
2023-7 to 2023-8: 632
2023-8 to 2023-9: 558
2023-9 to 2023-10: 525
2023-10 to 2023-11: 660
2023-11 to 2023-12: 667
2023-12 to 2024-1: 0
2024-1 to 2024-2: 0
2024-2 to 2024-3: 0
2024-3 to 2024-4: 0
2024-4 to 2024-5: 0
2024-5 to 2024-6: 0
2024-6 to 2024-7: 454
2024-7 to 2024-8: 371
2024-8 to 2024-9: 662
2024-9 to 2024-10: 720
2024-10 to 2024-11: 21
2024-11 to 2024-12: 0
2024-12 to 2025-1: 0

In [8]:
doha_df.head()

   value                   utc                      local parameter  units
0   79.0  2022-04-11T15:00:00Z  2022-04-11T18:00:00+03:00      pm25  µg/m³
1   71.0  2022-04-11T16:00:00Z  2022-04-11T19:00:00+03:00      pm25  µg/m³
2   70.0  2022-04-11T17:00:00Z  2022-04-11T20:00:00+03:00      pm25  µg/m³
3   72.0  2022-04-11T18:00:00Z  2022-04-11T21:00:00+03:00      pm25  µg/m³
4   86.0  2022-04-11T19:00:00Z  2022-04-11T22:00:00+03:00      pm25  µg/m³

In [19]:
doha_df.shape

NameError: name 'doha_df' is not defined

In [14]:
doha_df.to_csv(data_dir + 'openaq_doha_309834.csv', index=False)

# Bahrain - 7479

In [13]:
bahrain_sensors_ids = get_sensors_ids(7479)
bahrain_sensors_ids

[21703, 22562]

In [14]:
bahrain_sensors_ids = validate_sensors_ids(bahrain_sensors_ids)
bahrain_sensors_ids

[22562]

In [15]:
bahrain_df = pd.DataFrame(columns=['value', 'utc', 'local', 'parameter', 'units'])
bahrain_df

Empty DataFrame
Columns: [value, utc, local, parameter, units]
Index: []

In [16]:
for year in range(2016, 2021):
    for month in range(1, 13):
        data = get_data(22562, year, month)
        if isinstance(data, requests.models.Response):
            break
        bahrain_df = pd.concat([bahrain_df, data])

2016-1 to 2016-2: 0
2016-2 to 2016-3: 0
2016-3 to 2016-4: 0
2016-4 to 2016-5: 0
2016-5 to 2016-6: 0
2016-6 to 2016-7: 0
2016-7 to 2016-8: 0
2016-8 to 2016-9: 0
2016-9 to 2016-10: 0
2016-10 to 2016-11: 0
2016-11 to 2016-12: 0
2016-12 to 2017-1: 696

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/2790836245.py:7: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  bahrain_df = pd.concat([bahrain_df, data])

2017-1 to 2017-2: 720
2017-2 to 2017-3: 648
2017-3 to 2017-4: 714
2017-4 to 2017-5: 696
2017-5 to 2017-6: 720
2017-6 to 2017-7: 696
2017-7 to 2017-8: 481
2017-8 to 2017-9: 436
2017-9 to 2017-10: 594
2017-10 to 2017-11: 657
2017-11 to 2017-12: 515
2017-12 to 2018-1: 165
2018-1 to 2018-2: 481
2018-2 to 2018-3: 347
2018-3 to 2018-4: 471
2018-4 to 2018-5: 555
2018-5 to 2018-6: 589
2018-6 to 2018-7: 636
2018-7 to 2018-8: 698
2018-8 to 2018-9: 625
2018-9 to 2018-10: 650
2018-10 to 2018-11: 654
2018-11 to 2018-12: 690
2018-12 to 2019-1: 669
2019-1 to 2019-2: 720
2019-2 to 2019-3: 629
2019-3 to 2019-4: 714
2019-4 to 2019-5: 661
2019-5 to 2019-6: 697
2019-6 to 2019-7: 685
2019-7 to 2019-8: 709
2019-8 to 2019-9: 720
2019-9 to 2019-10: 696
2019-10 to 2019-11: 720
2019-11 to 2019-12: 692
2019-12 to 2020-1: 710
2020-1 to 2020-2: 720
2020-2 to 2020-3: 672
2020-3 to 2020-4: 710
2020-4 to 2020-5: 671
2020-5 to 2020-6: 628
2020-6 to 2020-7: 601
2020-7 to 2020-8: 646
2020-8 to 2020-9: 720
2020-9 to 2020-10: 696
2020-10 to 2020-11: 720
2020-11 to 2020-12: 673
2020-12 to 2021-1: 658

In [24]:
for year in range(2021, 2025):
    for month in range(1, 13):
        data = get_data(22562, year, month)
        if isinstance(data, requests.models.Response):
            break
        bahrain_df = pd.concat([bahrain_df, data])

2021-1 to 2021-2: 720
2021-2 to 2021-3: 598
2021-3 to 2021-4: 720
2021-4 to 2021-5: 645
2021-5 to 2021-6: 642
2021-6 to 2021-7: 660
2021-7 to 2021-8: 518
2021-8 to 2021-9: 656
2021-9 to 2021-10: 696
2021-10 to 2021-11: 720
2021-11 to 2021-12: 696
2021-12 to 2022-1: 720
2022-1 to 2022-2: 720
2022-2 to 2022-3: 648
2022-3 to 2022-4: 690
2022-4 to 2022-5: 696
2022-5 to 2022-6: 720
2022-6 to 2022-7: 696
2022-7 to 2022-8: 720
2022-8 to 2022-9: 720
2022-9 to 2022-10: 696
2022-10 to 2022-11: 720

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/998720952.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  bahrain_df = pd.concat([bahrain_df, data])

2022-11 to 2022-12: 696

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/998720952.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  bahrain_df = pd.concat([bahrain_df, data])

2022-12 to 2023-1: 720

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/998720952.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  bahrain_df = pd.concat([bahrain_df, data])

2023-1 to 2023-2: 618

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/998720952.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  bahrain_df = pd.concat([bahrain_df, data])

2023-2 to 2023-3: 76

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/998720952.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  bahrain_df = pd.concat([bahrain_df, data])

2023-3 to 2023-4: 276

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/998720952.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  bahrain_df = pd.concat([bahrain_df, data])

2023-4 to 2023-5: 665
2023-5 to 2023-6: 738
2023-6 to 2023-7: 720
2023-7 to 2023-8: 702
2023-8 to 2023-9: 744
2023-9 to 2023-10: 720
2023-10 to 2023-11: 744
2023-11 to 2023-12: 720
2023-12 to 2024-1: 744
2024-1 to 2024-2: 744
2024-2 to 2024-3: 678
2024-3 to 2024-4: 739
2024-4 to 2024-5: 720
2024-5 to 2024-6: 744
2024-6 to 2024-7: 720
2024-7 to 2024-8: 744
2024-8 to 2024-9: 744
2024-9 to 2024-10: 720
2024-10 to 2024-11: 23
2024-11 to 2024-12: 0
2024-12 to 2025-1: 0

In [25]:
bahrain_df.head()

   value                   utc                      local parameter  units
0   42.0  2016-12-01T22:00:00Z  2016-12-02T01:00:00+03:00      pm25  µg/m³
1   42.0  2016-12-01T23:00:00Z  2016-12-02T02:00:00+03:00      pm25  µg/m³
2   42.0  2016-12-02T00:00:00Z  2016-12-02T03:00:00+03:00      pm25  µg/m³
3   42.0  2016-12-02T01:00:00Z  2016-12-02T04:00:00+03:00      pm25  µg/m³
4   41.0  2016-12-02T02:00:00Z  2016-12-02T05:00:00+03:00      pm25  µg/m³

In [26]:
bahrain_df.shape

(61747, 5)

In [27]:
bahrain_df.to_csv(data_dir + 'openaq_bahrain_7479.csv', index=False)

# Kuwait - 8103

In [16]:
kuwait_sensors_ids = get_sensors_ids(8103)
kuwait_sensors_ids

[23491]

In [18]:
kuwait_sensors_ids = validate_sensors_ids(kuwait_sensors_ids)
kuwait_sensors_ids

[23491]

In [19]:
kuwait_df = pd.DataFrame(columns=['value', 'utc', 'local', 'parameter', 'units'])
kuwait_df

Empty DataFrame
Columns: [value, utc, local]
Index: []

In [20]:
for year in range(2017, 2025):
    for month in range(1, 13):
        data = get_data(23491, year, month)
        if isinstance(data, requests.models.Response):
            break
        kuwait_df = pd.concat([kuwait_df, data])

2017-1 to 2017-2: 0
2017-2 to 2017-3: 241

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52765/3313822323.py:7: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  kuwait_df = pd.concat([kuwait_df, data])

2017-3 to 2017-4: 714
2017-4 to 2017-5: 696
2017-5 to 2017-6: 720
2017-6 to 2017-7: 696
2017-7 to 2017-8: 480
2017-8 to 2017-9: 441
2017-9 to 2017-10: 582
2017-10 to 2017-11: 645
2017-11 to 2017-12: 554
2017-12 to 2018-1: 210
2018-1 to 2018-2: 599
2018-2 to 2018-3: 430
2018-3 to 2018-4: 468
2018-4 to 2018-5: 578
2018-5 to 2018-6: 550
2018-6 to 2018-7: 625
2018-7 to 2018-8: 692
2018-8 to 2018-9: 623
2018-9 to 2018-10: 659
2018-10 to 2018-11: 648
2018-11 to 2018-12: 694
2018-12 to 2019-1: 667
2019-1 to 2019-2: 719
2019-2 to 2019-3: 622
2019-3 to 2019-4: 715
2019-4 to 2019-5: 677
2019-5 to 2019-6: 706
2019-6 to 2019-7: 690
2019-7 to 2019-8: 717
2019-8 to 2019-9: 720
2019-9 to 2019-10: 696
2019-10 to 2019-11: 694
2019-11 to 2019-12: 696
2019-12 to 2020-1: 719
2020-1 to 2020-2: 720
2020-2 to 2020-3: 672
2020-3 to 2020-4: 710
2020-4 to 2020-5: 672
2020-5 to 2020-6: 647
2020-6 to 2020-7: 610
2020-7 to 2020-8: 676
2020-8 to 2020-9: 646
2020-9 to 2020-10: 660
2020-10 to 2020-11: 707
2020-11 to 2020-12: 686
2020-12 to 2021-1: 641
2021-1 to 2021-2: 720
2021-2 to 2021-3: 577
2021-3 to 2021-4: 659
2021-4 to 2021-5: 562
2021-5 to 2021-6: 405
2021-6 to 2021-7: 403
2021-7 to 2021-8: 335
2021-8 to 2021-9: 616
2021-9 to 2021-10: 696
2021-10 to 2021-11: 720
2021-11 to 2021-12: 696
2021-12 to 2022-1: 720
2022-1 to 2022-2: 720
2022-2 to 2022-3: 648
2022-3 to 2022-4: 688
2022-4 to 2022-5: 696
2022-5 to 2022-6: 720
2022-6 to 2022-7: 696
2022-7 to 2022-8: 720
2022-8 to 2022-9: 720
2022-9 to 2022-10: 696
2022-10 to 2022-11: 720
2022-11 to 2022-12: 696
2022-12 to 2023-1: 720
2023-1 to 2023-2: 618
2023-2 to 2023-3: 75
2023-3 to 2023-4: 277
2023-4 to 2023-5: 665
2023-5 to 2023-6: 744
2023-6 to 2023-7: 720
2023-7 to 2023-8: 722
2023-8 to 2023-9: 743
2023-9 to 2023-10: 720
2023-10 to 2023-11: 741
2023-11 to 2023-12: 715
2023-12 to 2024-1: 590
2024-1 to 2024-2: 729
2024-2 to 2024-3: 587
2024-3 to 2024-4: 505
2024-4 to 2024-5: 720
2024-5 to 2024-6: 744
2024-6 to 2024-7: 720
2024-7 to 2024-8: 744
2024-8 to 2024-9: 744
2024-9 to 2024-10: 720
2024-10 to 2024-11: 23

In [22]:
kuwait_df.shape

NameError: name 'kuwait_df' is not defined

In [26]:
kuwait_df.to_csv(data_dir + 'openaq_kuwait_8103.csv', index=False)

# Baghdad AirNow - 8839

In [28]:
baghdad_airnow_sensors_ids = get_sensors_ids(8839)
baghdad_airnow_sensors_ids

[25769]

In [29]:
baghdad_airnow_sensors_ids = validate_sensors_ids(baghdad_airnow_sensors_ids)
baghdad_airnow_sensors_ids

[25769]

In [32]:
baghdad_airnow_df = pd.DataFrame(columns=['value', 'utc', 'local', 'parameter', 'units'])
baghdad_airnow_df

Empty DataFrame
Columns: [value, utc, local, parameter, units]
Index: []

In [33]:
for year in range(2019, 2025):
    for month in range(1, 13):
        data = get_data(25769, year, month)
        if isinstance(data, requests.models.Response):
            break
        baghdad_airnow_df = pd.concat([baghdad_airnow_df, data])

2019-1 to 2019-2: 0
2019-2 to 2019-3: 0
2019-3 to 2019-4: 0
2019-4 to 2019-5: 0
2019-5 to 2019-6: 0
2019-6 to 2019-7: 0
2019-7 to 2019-8: 0
2019-8 to 2019-9: 0
2019-9 to 2019-10: 0
2019-10 to 2019-11: 61

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/636131796.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  baghdad_airnow_df = pd.concat([baghdad_airnow_df, data])

2019-11 to 2019-12: 505
2019-12 to 2020-1: 587
2020-1 to 2020-2: 427
2020-2 to 2020-3: 237
2020-3 to 2020-4: 597
2020-4 to 2020-5: 606
2020-5 to 2020-6: 140
2020-6 to 2020-7: 590
2020-7 to 2020-8: 553
2020-8 to 2020-9: 0
2020-9 to 2020-10: 92
2020-10 to 2020-11: 572
2020-11 to 2020-12: 570
2020-12 to 2021-1: 456
2021-1 to 2021-2: 593
2021-2 to 2021-3: 432
2021-3 to 2021-4: 434
2021-4 to 2021-5: 355
2021-5 to 2021-6: 283
2021-6 to 2021-7: 311
2021-7 to 2021-8: 271
2021-8 to 2021-9: 442
2021-9 to 2021-10: 371
2021-10 to 2021-11: 592
2021-11 to 2021-12: 565
2021-12 to 2022-1: 532
2022-1 to 2022-2: 412
2022-2 to 2022-3: 521
2022-3 to 2022-4: 476
2022-4 to 2022-5: 481
2022-5 to 2022-6: 531
2022-6 to 2022-7: 642
2022-7 to 2022-8: 688
2022-8 to 2022-9: 637
2022-9 to 2022-10: 689
2022-10 to 2022-11: 624
2022-11 to 2022-12: 696
2022-12 to 2023-1: 714
2023-1 to 2023-2: 569
2023-2 to 2023-3: 48
2023-3 to 2023-4: 275
2023-4 to 2023-5: 658
2023-5 to 2023-6: 742
2023-6 to 2023-7: 189
2023-7 to 2023-8: 0
2023-8 to 2023-9: 0
2023-9 to 2023-10: 0
2023-10 to 2023-11: 0
2023-11 to 2023-12: 0
2023-12 to 2024-1: 0

In [37]:
for year in range(2024, 2025):
    for month in range(1, 13):
        data = get_data(25769, year, month)
        if isinstance(data, requests.models.Response):
            break
        baghdad_airnow_df = pd.concat([baghdad_airnow_df, data])

2024-1 to 2024-2: 0
2024-2 to 2024-3: 0
2024-3 to 2024-4: 606
2024-4 to 2024-5: 706
2024-5 to 2024-6: 739
2024-6 to 2024-7: 654
2024-7 to 2024-8: 520
2024-8 to 2024-9: 744
2024-9 to 2024-10: 587
2024-10 to 2024-11: 23
2024-11 to 2024-12: 0
2024-12 to 2025-1: 0

In [38]:
baghdad_airnow_df.head()

   value                   utc                      local parameter  units
0   31.0  2019-10-28T19:00:00Z  2019-10-28T22:00:00+03:00      pm25  µg/m³
1   44.0  2019-10-28T21:00:00Z  2019-10-29T00:00:00+03:00      pm25  µg/m³
2   27.0  2019-10-28T22:00:00Z  2019-10-29T01:00:00+03:00      pm25  µg/m³
3   20.0  2019-10-29T00:00:00Z  2019-10-29T03:00:00+03:00      pm25  µg/m³
4   15.0  2019-10-29T01:00:00Z  2019-10-29T04:00:00+03:00      pm25  µg/m³

In [39]:
baghdad_airnow_df.shape

(25345, 5)

In [40]:
baghdad_airnow_df.to_csv(data_dir + 'openaq_baghdad_airnow_8839.csv', index=False)

# Baghdad US Embassy - 8887

In [42]:
baghdad_embassy_sensors_ids = get_sensors_ids(8887)
baghdad_embassy_sensors_ids

[25932]

In [43]:
baghdad_embassy_sensors_ids = validate_sensors_ids(baghdad_embassy_sensors_ids)
baghdad_embassy_sensors_ids

[25932]

In [44]:
baghdad_embassy_df = pd.DataFrame(columns=['value', 'utc', 'local', 'parameter', 'units'])
baghdad_embassy_df

Empty DataFrame
Columns: [value, utc, local, parameter, units]
Index: []

In [45]:
for year in range(2019, 2024):
    for month in range(1, 13):
        data = get_data(25932, year, month)
        if isinstance(data, requests.models.Response):
            break
        baghdad_embassy_df = pd.concat([baghdad_embassy_df, data])

2019-1 to 2019-2: 0
2019-2 to 2019-3: 0
2019-3 to 2019-4: 485

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/3070106291.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  baghdad_embassy_df = pd.concat([baghdad_embassy_df, data])

2019-4 to 2019-5: 674
2019-5 to 2019-6: 714
2019-6 to 2019-7: 688
2019-7 to 2019-8: 713
2019-8 to 2019-9: 720
2019-9 to 2019-10: 696
2019-10 to 2019-11: 694
2019-11 to 2019-12: 674
2019-12 to 2020-1: 689
2020-1 to 2020-2: 714
2020-2 to 2020-3: 672
2020-3 to 2020-4: 711
2020-4 to 2020-5: 656
2020-5 to 2020-6: 424
2020-6 to 2020-7: 496
2020-7 to 2020-8: 633
2020-8 to 2020-9: 449

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/3070106291.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  baghdad_embassy_df = pd.concat([baghdad_embassy_df, data])

2020-9 to 2020-10: 515
2020-10 to 2020-11: 606
2020-11 to 2020-12: 595
2020-12 to 2021-1: 593
2021-1 to 2021-2: 702
2021-2 to 2021-3: 438
2021-3 to 2021-4: 557
2021-4 to 2021-5: 563
2021-5 to 2021-6: 389
2021-6 to 2021-7: 377
2021-7 to 2021-8: 297
2021-8 to 2021-9: 608
2021-9 to 2021-10: 692
2021-10 to 2021-11: 720
2021-11 to 2021-12: 696
2021-12 to 2022-1: 720
2022-1 to 2022-2: 720
2022-2 to 2022-3: 648
2022-3 to 2022-4: 690
2022-4 to 2022-5: 696
2022-5 to 2022-6: 720
2022-6 to 2022-7: 696
2022-7 to 2022-8: 720
2022-8 to 2022-9: 720
2022-9 to 2022-10: 696
2022-10 to 2022-11: 720
2022-11 to 2022-12: 696
2022-12 to 2023-1: 720
2023-1 to 2023-2: 618
2023-2 to 2023-3: 75
2023-3 to 2023-4: 277
2023-4 to 2023-5: 653
2023-5 to 2023-6: 704
2023-6 to 2023-7: 704
2023-7 to 2023-8: 695

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/3070106291.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  baghdad_embassy_df = pd.concat([baghdad_embassy_df, data])

2023-8 to 2023-9: 617

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/3070106291.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  baghdad_embassy_df = pd.concat([baghdad_embassy_df, data])

2023-9 to 2023-10: 720

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/3070106291.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  baghdad_embassy_df = pd.concat([baghdad_embassy_df, data])

2023-10 to 2023-11: 744
2023-11 to 2023-12: 45

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/3070106291.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  baghdad_embassy_df = pd.concat([baghdad_embassy_df, data])
/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/3070106291.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  baghdad_embassy_df = pd.concat([baghdad_embassy_df, data])

2023-12 to 2024-1: 0

In [46]:
for year in range(2024, 2025):
    for month in range(1, 13):
        data = get_data(25932, year, month)
        if isinstance(data, requests.models.Response):
            break
        baghdad_embassy_df = pd.concat([baghdad_embassy_df, data])

2024-1 to 2024-2: 0
2024-2 to 2024-3: 0
2024-3 to 2024-4: 313
2024-4 to 2024-5: 720
2024-5 to 2024-6: 744
2024-6 to 2024-7: 720
2024-7 to 2024-8: 744
2024-8 to 2024-9: 744
2024-9 to 2024-10: 720
2024-10 to 2024-11: 23
2024-11 to 2024-12: 0
2024-12 to 2025-1: 0

In [47]:
baghdad_embassy_df.head()

   value                   utc                      local parameter  units
0   16.0  2019-03-10T16:00:00Z  2019-03-10T19:00:00+03:00      pm25  µg/m³
1   27.0  2019-03-10T17:00:00Z  2019-03-10T20:00:00+03:00      pm25  µg/m³
2   44.0  2019-03-10T18:00:00Z  2019-03-10T21:00:00+03:00      pm25  µg/m³
3   63.0  2019-03-10T19:00:00Z  2019-03-10T22:00:00+03:00      pm25  µg/m³
4   74.0  2019-03-10T20:00:00Z  2019-03-10T23:00:00+03:00      pm25  µg/m³

In [48]:
baghdad_embassy_df.shape

(39592, 5)

In [49]:
baghdad_embassy_df.to_csv(data_dir + 'openaq_baghdad_embassy_8887.csv', index=False)

# Turkmenistan - 8170

In [50]:
turkmenistan_sensors_ids = get_sensors_ids(8170)
turkmenistan_sensors_ids

[23772]

In [51]:
turkmenistan_sensors_ids = validate_sensors_ids(turkmenistan_sensors_ids)
turkmenistan_sensors_ids

[23772]

In [52]:
turkmenistan_df = pd.DataFrame(columns=['value', 'utc', 'local', 'parameter', 'units'])
turkmenistan_df

Empty DataFrame
Columns: [value, utc, local, parameter, units]
Index: []

In [53]:
for year in range(2019, 2024):
    for month in range(1, 13):
        data = get_data(23772, year, month)
        if isinstance(data, requests.models.Response):
            break
        turkmenistan_df = pd.concat([turkmenistan_df, data])

2019-1 to 2019-2: 0
2019-2 to 2019-3: 0
2019-3 to 2019-4: 0
2019-4 to 2019-5: 0
2019-5 to 2019-6: 0
2019-6 to 2019-7: 0
2019-7 to 2019-8: 0
2019-8 to 2019-9: 0
2019-9 to 2019-10: 0
2019-10 to 2019-11: 258

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/46295368.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  turkmenistan_df = pd.concat([turkmenistan_df, data])

2019-11 to 2019-12: 691
2019-12 to 2020-1: 710
2020-1 to 2020-2: 720
2020-2 to 2020-3: 667
2020-3 to 2020-4: 709
2020-4 to 2020-5: 664
2020-5 to 2020-6: 564
2020-6 to 2020-7: 579
2020-7 to 2020-8: 618
2020-8 to 2020-9: 657
2020-9 to 2020-10: 676
2020-10 to 2020-11: 693
2020-11 to 2020-12: 653
2020-12 to 2021-1: 641
2021-1 to 2021-2: 720
2021-2 to 2021-3: 577
2021-3 to 2021-4: 693
2021-4 to 2021-5: 599
2021-5 to 2021-6: 625
2021-6 to 2021-7: 648
2021-7 to 2021-8: 515
2021-8 to 2021-9: 636
2021-9 to 2021-10: 696
2021-10 to 2021-11: 720
2021-11 to 2021-12: 696
2021-12 to 2022-1: 720
2022-1 to 2022-2: 720
2022-2 to 2022-3: 648
2022-3 to 2022-4: 688
2022-4 to 2022-5: 696
2022-5 to 2022-6: 720
2022-6 to 2022-7: 696
2022-7 to 2022-8: 720
2022-8 to 2022-9: 720
2022-9 to 2022-10: 696
2022-10 to 2022-11: 720
2022-11 to 2022-12: 696
2022-12 to 2023-1: 720
2023-1 to 2023-2: 618
2023-2 to 2023-3: 77
2023-3 to 2023-4: 275
2023-4 to 2023-5: 653
2023-5 to 2023-6: 671
2023-6 to 2023-7: 704
2023-7 to 2023-8: 671
2023-8 to 2023-9: 617
2023-9 to 2023-10: 720
2023-10 to 2023-11: 522
2023-11 to 2023-12: 42
2023-12 to 2024-1: 0

In [56]:
for year in range(2024, 2025):
    for month in range(1, 13):
        data = get_data(23772, year, month)
        if isinstance(data, requests.models.Response):
            break
        turkmenistan_df = pd.concat([turkmenistan_df, data])

2024-1 to 2024-2: 0
2024-2 to 2024-3: 0
2024-3 to 2024-4: 305
2024-4 to 2024-5: 720
2024-5 to 2024-6: 744
2024-6 to 2024-7: 720
2024-7 to 2024-8: 744
2024-8 to 2024-9: 744
2024-9 to 2024-10: 720
2024-10 to 2024-11: 26
2024-11 to 2024-12: 0
2024-12 to 2025-1: 0

In [57]:
turkmenistan_df.head()

   value                   utc                      local parameter  units
0   14.0  2019-10-20T22:00:00Z  2019-10-21T03:00:00+05:00      pm25  µg/m³
1   10.0  2019-10-20T23:00:00Z  2019-10-21T04:00:00+05:00      pm25  µg/m³
2    9.0  2019-10-21T00:00:00Z  2019-10-21T05:00:00+05:00      pm25  µg/m³
3    8.0  2019-10-21T01:00:00Z  2019-10-21T06:00:00+05:00      pm25  µg/m³
4   12.0  2019-10-21T02:00:00Z  2019-10-21T07:00:00+05:00      pm25  µg/m³

In [58]:
turkmenistan_df.shape

(36078, 5)

In [59]:
turkmenistan_df.to_csv(data_dir + 'openaq_turkmenistan_8170.csv', index=False)

# Kyrgyzstan Osh State University - 2812567

In [60]:
kyrgyzstan_os_sensors_ids = get_sensors_ids(2812567)
kyrgyzstan_os_sensors_ids

[8966993]

In [61]:
kyrgyzstan_os_sensors_ids = validate_sensors_ids(kyrgyzstan_os_sensors_ids)
kyrgyzstan_os_sensors_ids

[8966993]

In [63]:
kyrgyzstan_os_df = pd.DataFrame(columns=['value', 'utc', 'local', 'parameter', 'units'])
kyrgyzstan_os_df

Empty DataFrame
Columns: [value, utc, local, parameter, units]
Index: []

In [64]:
for year in range(2024, 2025):
    for month in range(1, 13):
        data = get_data(8966993, year, month)
        if isinstance(data, requests.models.Response):
            break
        kyrgyzstan_os_df = pd.concat([kyrgyzstan_os_df, data])

2024-1 to 2024-2: 0
2024-2 to 2024-3: 0
2024-3 to 2024-4: 0
2024-4 to 2024-5: 98

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/190769206.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  kyrgyzstan_os_df = pd.concat([kyrgyzstan_os_df, data])

2024-5 to 2024-6: 674
2024-6 to 2024-7: 661
2024-7 to 2024-8: 601
2024-8 to 2024-9: 568
2024-9 to 2024-10: 523
2024-10 to 2024-11: 12
2024-11 to 2024-12: 0
2024-12 to 2025-1: 0

In [65]:
kyrgyzstan_os_df.head()

   value                   utc                      local parameter  units
0   8.80  2024-04-24T16:00:00Z  2024-04-24T22:00:00+06:00      pm25  µg/m³
1   1.60  2024-04-24T17:00:00Z  2024-04-24T23:00:00+06:00      pm25  µg/m³
2   0.77  2024-04-26T11:00:00Z  2024-04-26T17:00:00+06:00      pm25  µg/m³
3   0.51  2024-04-26T12:00:00Z  2024-04-26T18:00:00+06:00      pm25  µg/m³
4   0.00  2024-04-26T13:00:00Z  2024-04-26T19:00:00+06:00      pm25  µg/m³

In [66]:
kyrgyzstan_os_df.shape

(3137, 5)

In [67]:
kyrgyzstan_os_df.to_csv(data_dir + 'openaq_kyrgyzstan_osh_state_university_2812567.csv', index=False)

# Uzbekistan - 8881

In [68]:
uzbekistan_sensors_ids = get_sensors_ids(8881)
uzbekistan_sensors_ids

[25915, 25916]

In [69]:
uzbekistan_sensors_ids = validate_sensors_ids(uzbekistan_sensors_ids)
uzbekistan_sensors_ids

[25916]

In [70]:
uzbekistan_df = pd.DataFrame(columns=['value', 'utc', 'local', 'parameter', 'units'])
uzbekistan_df

Empty DataFrame
Columns: [value, utc, local, parameter, units]
Index: []

In [71]:
for year in range(2018, 2023):
    for month in range(1, 13):
        data = get_data(25916, year, month)
        if isinstance(data, requests.models.Response):
            break
        uzbekistan_df = pd.concat([uzbekistan_df, data])

2018-1 to 2018-2: 0
2018-2 to 2018-3: 0
2018-3 to 2018-4: 0
2018-4 to 2018-5: 0
2018-5 to 2018-6: 0
2018-6 to 2018-7: 0
2018-7 to 2018-8: 0
2018-8 to 2018-9: 0
2018-9 to 2018-10: 0
2018-10 to 2018-11: 0
2018-11 to 2018-12: 69

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/2146102559.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  uzbekistan_df = pd.concat([uzbekistan_df, data])

2018-12 to 2019-1: 669
2019-1 to 2019-2: 719
2019-2 to 2019-3: 629
2019-3 to 2019-4: 715
2019-4 to 2019-5: 685
2019-5 to 2019-6: 715

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/2146102559.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  uzbekistan_df = pd.concat([uzbekistan_df, data])

2019-6 to 2019-7: 689
2019-7 to 2019-8: 710
2019-8 to 2019-9: 719
2019-9 to 2019-10: 696
2019-10 to 2019-11: 699
2019-11 to 2019-12: 693
2019-12 to 2020-1: 711
2020-1 to 2020-2: 719
2020-2 to 2020-3: 672
2020-3 to 2020-4: 710
2020-4 to 2020-5: 683
2020-5 to 2020-6: 684
2020-6 to 2020-7: 671
2020-7 to 2020-8: 685
2020-8 to 2020-9: 659
2020-9 to 2020-10: 696
2020-10 to 2020-11: 720
2020-11 to 2020-12: 680
2020-12 to 2021-1: 660
2021-1 to 2021-2: 720
2021-2 to 2021-3: 586
2021-3 to 2021-4: 718
2021-4 to 2021-5: 645
2021-5 to 2021-6: 640
2021-6 to 2021-7: 654
2021-7 to 2021-8: 511
2021-8 to 2021-9: 645
2021-9 to 2021-10: 696
2021-10 to 2021-11: 720
2021-11 to 2021-12: 696
2021-12 to 2022-1: 720
2022-1 to 2022-2: 720
2022-2 to 2022-3: 648
2022-3 to 2022-4: 688
2022-4 to 2022-5: 696
2022-5 to 2022-6: 720
2022-6 to 2022-7: 696
2022-7 to 2022-8: 720
2022-8 to 2022-9: 720

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/2146102559.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  uzbekistan_df = pd.concat([uzbekistan_df, data])

2022-9 to 2022-10: 696

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/2146102559.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  uzbekistan_df = pd.concat([uzbekistan_df, data])

2022-10 to 2022-11: 720
2022-11 to 2022-12: 696
2022-12 to 2023-1: 720

In [74]:
for year in range(2023, 2025):
    for month in range(1, 13):
        data = get_data(25916, year, month)
        if isinstance(data, requests.models.Response):
            break
        uzbekistan_df = pd.concat([uzbekistan_df, data])

2023-1 to 2023-2: 618
2023-2 to 2023-3: 77
2023-3 to 2023-4: 275
2023-4 to 2023-5: 665
2023-5 to 2023-6: 732
2023-6 to 2023-7: 720
2023-7 to 2023-8: 723
2023-8 to 2023-9: 742
2023-9 to 2023-10: 720
2023-10 to 2023-11: 742
2023-11 to 2023-12: 720
2023-12 to 2024-1: 744
2024-1 to 2024-2: 744
2024-2 to 2024-3: 678
2024-3 to 2024-4: 739
2024-4 to 2024-5: 720
2024-5 to 2024-6: 744
2024-6 to 2024-7: 720
2024-7 to 2024-8: 744
2024-8 to 2024-9: 744
2024-9 to 2024-10: 720
2024-10 to 2024-11: 25
2024-11 to 2024-12: 0

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/3422607954.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  uzbekistan_df = pd.concat([uzbekistan_df, data])

2024-12 to 2025-1: 0

In [75]:
uzbekistan_df.head()

   value                   utc                      local parameter  units
0   21.0  2018-11-27T22:00:00Z  2018-11-28T03:00:00+05:00      pm25  µg/m³
1   36.0  2018-11-27T23:00:00Z  2018-11-28T04:00:00+05:00      pm25  µg/m³
2   51.0  2018-11-28T00:00:00Z  2018-11-28T05:00:00+05:00      pm25  µg/m³
3   36.0  2018-11-28T01:00:00Z  2018-11-28T06:00:00+05:00      pm25  µg/m³
4   33.0  2018-11-28T02:00:00Z  2018-11-28T07:00:00+05:00      pm25  µg/m³

In [76]:
uzbekistan_df.shape

(47804, 5)

In [77]:
uzbekistan_df.to_csv(data_dir + 'openaq_uzbekistan_8881.csv', index=False)

# Tajikistan Dushanbe - 8684

In [78]:
tajikistan_dushanbe_sensors_ids = get_sensors_ids(8684)
tajikistan_dushanbe_sensors_ids

[25215]

In [79]:
tajikistan_dushanbe_sensors_ids = validate_sensors_ids(tajikistan_dushanbe_sensors_ids)
tajikistan_dushanbe_sensors_ids

[25215]

In [80]:
tajikistan_dushanbe_df = pd.DataFrame(columns=['value', 'utc', 'local', 'parameter', 'units'])
tajikistan_dushanbe_df

Empty DataFrame
Columns: [value, utc, local, parameter, units]
Index: []

In [81]:
for year in range(2019, 2025):
    for month in range(1, 13):
        data = get_data(25215, year, month)
        if isinstance(data, requests.models.Response):
            break
        tajikistan_dushanbe_df = pd.concat([tajikistan_dushanbe_df, data])

2019-1 to 2019-2: 0
2019-2 to 2019-3: 0
2019-3 to 2019-4: 0
2019-4 to 2019-5: 0
2019-5 to 2019-6: 0
2019-6 to 2019-7: 0
2019-7 to 2019-8: 0
2019-8 to 2019-9: 0
2019-9 to 2019-10: 0
2019-10 to 2019-11: 72

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/4068343.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  tajikistan_dushanbe_df = pd.concat([tajikistan_dushanbe_df, data])

2019-11 to 2019-12: 690
2019-12 to 2020-1: 706
2020-1 to 2020-2: 715
2020-2 to 2020-3: 657
2020-3 to 2020-4: 697
2020-4 to 2020-5: 644
2020-5 to 2020-6: 594
2020-6 to 2020-7: 596
2020-7 to 2020-8: 582
2020-8 to 2020-9: 540
2020-9 to 2020-10: 571
2020-10 to 2020-11: 621
2020-11 to 2020-12: 589
2020-12 to 2021-1: 471
2021-1 to 2021-2: 646
2021-2 to 2021-3: 508
2021-3 to 2021-4: 581
2021-4 to 2021-5: 406
2021-5 to 2021-6: 328
2021-6 to 2021-7: 384
2021-7 to 2021-8: 323
2021-8 to 2021-9: 514
2021-9 to 2021-10: 649
2021-10 to 2021-11: 700
2021-11 to 2021-12: 659
2021-12 to 2022-1: 684
2022-1 to 2022-2: 667
2022-2 to 2022-3: 499
2022-3 to 2022-4: 404
2022-4 to 2022-5: 670
2022-5 to 2022-6: 659
2022-6 to 2022-7: 671
2022-7 to 2022-8: 550
2022-8 to 2022-9: 711
2022-9 to 2022-10: 688
2022-10 to 2022-11: 702
2022-11 to 2022-12: 656
2022-12 to 2023-1: 715
2023-1 to 2023-2: 614
2023-2 to 2023-3: 78
2023-3 to 2023-4: 216
2023-4 to 2023-5: 524
2023-5 to 2023-6: 685
2023-6 to 2023-7: 718
2023-7 to 2023-8: 719
2023-8 to 2023-9: 743
2023-9 to 2023-10: 609
2023-10 to 2023-11: 687
2023-11 to 2023-12: 535
2023-12 to 2024-1: 737
2024-1 to 2024-2: 710
2024-2 to 2024-3: 675
2024-3 to 2024-4: 730
2024-4 to 2024-5: 717
2024-5 to 2024-6: 744
2024-6 to 2024-7: 712
2024-7 to 2024-8: 743
2024-8 to 2024-9: 621
2024-9 to 2024-10: 715
2024-10 to 2024-11: 25
2024-11 to 2024-12: 0
2024-12 to 2025-1: 0

In [82]:
tajikistan_dushanbe_df.head()

   value                   utc                      local parameter  units
0   29.0  2019-10-28T19:00:00Z  2019-10-29T00:00:00+05:00      pm25  µg/m³
1   29.0  2019-10-28T20:00:00Z  2019-10-29T01:00:00+05:00      pm25  µg/m³
2   26.0  2019-10-28T21:00:00Z  2019-10-29T02:00:00+05:00      pm25  µg/m³
3   21.0  2019-10-28T22:00:00Z  2019-10-29T03:00:00+05:00      pm25  µg/m³
4   39.0  2019-10-28T23:00:00Z  2019-10-29T04:00:00+05:00      pm25  µg/m³

In [83]:
tajikistan_dushanbe_df.shape

(35976, 5)

In [84]:
tajikistan_dushanbe_df.to_csv(data_dir + 'openaq_tajikistan_dushanbe_8684.csv', index=False)

# Tajikistan Embassy - 9769

In [85]:
tajikistan_embassy_sensors_ids = get_sensors_ids(9769)
tajikistan_embassy_sensors_ids

[30477]

In [86]:
tajikistan_embassy_sensors_ids = validate_sensors_ids(tajikistan_embassy_sensors_ids)
tajikistan_embassy_sensors_ids

[30477]

In [87]:
tajikistan_embassy_df = pd.DataFrame(columns=['value', 'utc', 'local', 'parameter', 'units'])
tajikistan_embassy_df

Empty DataFrame
Columns: [value, utc, local, parameter, units]
Index: []

In [88]:
for year in range(2019, 2025):
    for month in range(1, 13):
        data = get_data(30477, year, month)
        if isinstance(data, requests.models.Response):
            break
        tajikistan_embassy_df = pd.concat([tajikistan_embassy_df, data])

2019-1 to 2019-2: 0
2019-2 to 2019-3: 0
2019-3 to 2019-4: 0
2019-4 to 2019-5: 0
2019-5 to 2019-6: 0
2019-6 to 2019-7: 0
2019-7 to 2019-8: 0
2019-8 to 2019-9: 0
2019-9 to 2019-10: 0
2019-10 to 2019-11: 256

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/3598324360.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  tajikistan_embassy_df = pd.concat([tajikistan_embassy_df, data])

2019-11 to 2019-12: 692
2019-12 to 2020-1: 710
2020-1 to 2020-2: 720
2020-2 to 2020-3: 672
2020-3 to 2020-4: 707
2020-4 to 2020-5: 658
2020-5 to 2020-6: 524
2020-6 to 2020-7: 546
2020-7 to 2020-8: 618
2020-8 to 2020-9: 651
2020-9 to 2020-10: 677
2020-10 to 2020-11: 720
2020-11 to 2020-12: 616
2020-12 to 2021-1: 648
2021-1 to 2021-2: 720
2021-2 to 2021-3: 579
2021-3 to 2021-4: 711
2021-4 to 2021-5: 613
2021-5 to 2021-6: 633
2021-6 to 2021-7: 656
2021-7 to 2021-8: 508
2021-8 to 2021-9: 643
2021-9 to 2021-10: 696
2021-10 to 2021-11: 720
2021-11 to 2021-12: 696
2021-12 to 2022-1: 720
2022-1 to 2022-2: 720
2022-2 to 2022-3: 648
2022-3 to 2022-4: 688
2022-4 to 2022-5: 696
2022-5 to 2022-6: 720
2022-6 to 2022-7: 696
2022-7 to 2022-8: 720
2022-8 to 2022-9: 720
2022-9 to 2022-10: 696
2022-10 to 2022-11: 720
2022-11 to 2022-12: 696
2022-12 to 2023-1: 720
2023-1 to 2023-2: 618
2023-2 to 2023-3: 77
2023-3 to 2023-4: 275
2023-4 to 2023-5: 653
2023-5 to 2023-6: 671
2023-6 to 2023-7: 704
2023-7 to 2023-8: 671
2023-8 to 2023-9: 617
2023-9 to 2023-10: 720
2023-10 to 2023-11: 522
2023-11 to 2023-12: 42

/var/folders/yg/c525c7x92dzdbplgm0_j_39r0000gn/T/ipykernel_52951/3598324360.py:6: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  tajikistan_embassy_df = pd.concat([tajikistan_embassy_df, data])

2023-12 to 2024-1: 0

In [90]:
for year in range(2024, 2025):
    for month in range(1, 13):
        data = get_data(30477, year, month)
        if isinstance(data, requests.models.Response):
            break
        tajikistan_embassy_df = pd.concat([tajikistan_embassy_df, data])

2024-1 to 2024-2: 0
2024-2 to 2024-3: 0
2024-3 to 2024-4: 305
2024-4 to 2024-5: 720
2024-5 to 2024-6: 744
2024-6 to 2024-7: 720
2024-7 to 2024-8: 744
2024-8 to 2024-9: 744
2024-9 to 2024-10: 720
2024-10 to 2024-11: 26
2024-11 to 2024-12: 0
2024-12 to 2025-1: 0

In [91]:
tajikistan_embassy_df.head()

   value                   utc                      local parameter  units
0   34.0  2019-10-20T23:00:00Z  2019-10-21T04:00:00+05:00      pm25  µg/m³
1   44.0  2019-10-21T00:00:00Z  2019-10-21T05:00:00+05:00      pm25  µg/m³
2   51.0  2019-10-21T01:00:00Z  2019-10-21T06:00:00+05:00      pm25  µg/m³
3   45.0  2019-10-21T02:00:00Z  2019-10-21T07:00:00+05:00      pm25  µg/m³
4   60.0  2019-10-21T03:00:00Z  2019-10-21T08:00:00+05:00      pm25  µg/m³

In [92]:
tajikistan_embassy_df.shape

(36043, 5)

In [93]:
tajikistan_embassy_df.to_csv(data_dir + 'openaq_tajikistan_embassy_9769.csv', index=False)